{"start":[{"caption":"","text":"Just another day at the Wealdstone Aysgarth Adventurers' Accounting office..."},{"caption":"","text":"I pray that today will bring sweet water, light laughter, and REASONABLE clients."},{"caption":"","text":"My goodness, if I could tell you about some of the ridiculous clients I've had this week..."},{"caption":"","text":"But I can't dally, I have lots of work to do today."},{"caption":"","text":"Oh, speaking of which, here's my first client!"},{"caption":"Barkeep","text":"Good day, sir!"},{"caption":"Barkeep","text":"I bring tales of all my expenses and earnings! For once I'm prepared for the tax season!"},{"caption":"Accountant","text":"Great, let us get started then!"},{"caption":"","text":"This ought to be an easy one, I've known the local barkeep for years now, I could file his taxes in my sleep."},{"caption":"","text":"So long as he doesn't spring anything out of the ordinary on me today."},{"caption":"Accountant","text":"So, still working at the Dusty Dragon Drafthouse, right?"},{"caption":"Barkeep","text":"Aye! You were just in last night! You think I managed to get fired since you last saw me?"},{"caption":"","text":"I wouldn't be that surprised. In addition to being the village barkeep, he's also the village drunk."},{"caption":"Accountant","text":"*Ahem* Of course not."},{"caption":"","text":"I pull out a standard W-2. Hopefully this will be all I need for this client."},{"caption":"Accountant","text":"Now let's get started, shall we?"},{"action":"jump","label":"innkeeper_chat"}],"innkeeper_chat":[[{"result":[{"caption":"Accountant","text":"Okay, how much income have you made this past year?"},{"caption":"Barkeep","text":"<Dialogue in progress.>"}],"choice":"Income"},{"result":[{"caption":"Accountant","text":"Did you factor tips into your income?"},{"caption":"Barkeep","text":"<Dialogue in progress.>"}],"choice":"Tips"},{"result":[{"action":"call","label":"innkeeper_deductions"}],"choice":"Deductions"},{"result":[{"caption":"Accountant","text":"I assume no business, as usual?"},{"caption":"Barkeep","text":"Well, about that, I was talking to another inn worker and they told me I was missing out on a lot of savings because I wasn't counting my business expenses!"},{"caption":"Barkeep","text":"*grumble* You know I pay you good gold every year to do my taxes, you really ought to have known this kinda stuff *grumble*"},{"caption":"","text":"I politely pretend to not hear his grumblings and pull out the appropriate business expense form from behind my desk."},{"caption":"Barkeep","text":"Anyhow, this feller was telling me he claims bartender school, and his Gorgon insurance, and ale..."},{"caption":"Accountant","text":"Okay, okay, hold up one moment, I need to write down all the relevant information."},{"caption":"Accountant","text":"First off, bartender school...that makes sense, job training is definitely a legitimate expense. How much does that cost you a year?"},{"caption":"Barkeep","text":"Oh, it's 50 gold pieces a class, and I take about 4 a year. Gotta keep up with all the new bartending trends."},{"caption":"Barkeep","text":"Did you know they're making drink with beholder eyes now? Youngins' these days are coming up with all sorts of new fangled trends."},[{"result":[{"caption":"Barkeep","text":"I just added a drink like that to the menu!"},{"caption":"Barkeep","text":"Come down and try it sometime!"},{"caption":"","text":"How about...no..."}],"choice":"Huh, I did not know that."},{"result":[{"caption":"Barkeep","text":"Aww, common, no need to get all judgmental."},{"caption":"","text":"That's a hard ask..."}],"choice":"That sounds...ineresting..."}],{"caption":"Accountant","text":"Anyhow, what about Gorgon insurance? You're not really an adventurer, so I'm not sure you need protection from monsters."},{"caption":"Barkeep","text":"MONSTERS? Well, I'll be, I thought you were more open minded than that."},{"caption":"Accountant","text":"I, uh, well..."},{"caption":"Barkeep","text":"Those MONSTERS, as you so boldly put it, are actually GREAT customers of mine. We have a weekly all-Gorgon knitting group that comes in on Sundays."},{"caption":"Barkeep","text":"You be amazed what they can make! All them snake hairs are like extra hands for holding knitting needles, and when you have 20 knittin' needles going all at once you can knit 20 times as fast!"},[{"result":[{"caption":"Barkeep","text":"EH you ain't know nothing about Gorgons. NOTHIN'."},{"caption":"","text":"I was actually referring to the knitting part...as an accomplished fiber artist I'm confident that's not how knitting works..."},{"caption":"","text":"But as an accountant I know we're getting way off task. I need to reign this conversation back in."},{"caption":"Accountant","text":"It's nice that you welcome diverse clientele, but you customers aren't supposed to be attacking you. Why do you need insurance against them?"},{"caption":"Barkeep","text":"Of course they ain't attacking me! Especially at my place of employment! It ain't like they're not civilized."}],"choice":"I'm not sure that's how it works at all..."},{"result":[{"caption":"Barkeep","text":"Well they ARE great, in fact!"}],"choice":"Okay if they're sooo great why do you need insurance?"}],{"caption":"Barkeep","text":"They're are lovely snake ladies that just want a quiet warm corner to knit and gossip in, and they always buy a few rounds and tip well."},{"caption":"Barkeep","text":"They don't want no trouble, they keep themselves blindfolded so they don't bother nobody!"},{"caption":"Accountant","text":"That's mighty considerate of them..."},{"caption":"Barkeep","text":"Of course accidents do happen sometimes...I shouldn't have put so much pepper in Stheno's stew, but I knew she liked this spicy, or rather 'SsssSSSsssspicy', as she puts it..."},{"caption":"Barkeep","text":"She sneezed her blindfold clean off and caught the gaze of Kevin, the little orphan boy who sweeps our floors."},{"caption":"Barkeep","text":"Poor kevin..."},{"caption":"","text":"The bar keep stares solemnly into space for a few moments."},{"caption":"Barkeep","text":"Anyhow, I've been paying for Gorgon insurance ever since. It's a risk that comes with the job."},{"caption":"Accountant","text":"Right, that makes sense...I guess...how much is that?"},{"caption":"Barkeep","text":"85 gold pieces a year."},{"caption":"Accountant","text":"Okay. Seems we're almost done her. The last thing is...ale? Was it ale you said?"},{"caption":"","text":"He perks up noticably. Ale must be his favorite subject."},{"caption":"Barkeep","text":"Yes siree! Oh boy am I ready for this one. I spend sooo much on ale, just look and see here!"},{"caption":"","text":"He pushes a pile of receipts towards me."},[{"result":[],"choice":"Read them all and start meticulously documenting them for your records."},{"result":[],"choice":"Skim the top few on the pile."}],{"caption":"Accountant","text":"Wait a minute...are these...all for your own drinks?"},{"caption":"Barkeep","text":"Yeah, well, I'm not STOCKIN' the place ya know. I'm the bar keep, not the owner."},{"caption":"Accountant","text":"Yes, right, so...why do you think your drinks count as a business expense?"},{"caption":"Barkeep","text":"Well, you know how it is at the inn! I gotta really put in the effort if I want to make those tips! I'm like a one man circus!"},{"caption":"Barkeep","text":"Gotta pour drinks, gotta count coins, gotta bark and yell 'Hey! Adventurer! Come wet your throat and rest your eyes!' Gotta be courteous gotta be charming!"},{"caption":"Barkeep","text":"And sometimes, I gotta DRINK!"},{"caption":"Barkeep","text":"Patrons love it when I have a drink with them! Really gets them to open their wallets and tip!"},{"caption":"Barkeep","text":"Remember last night, we split a drink, and you have me a good tip!"},{"caption":"","text":"Ah yes, how could I forget."},{"caption":"","text":"All I wanted was a quiet drink to relax with after a long days work instead I got a sloppy bar keep pouring ale all over my lap."},{"caption":"","text":"Really that tip was more to make him go away than anything else."},{"caption":"Accountant","text":"I'm...not sure this counts as a business expense."},{"caption":"","text":"<Dialogue in progress.>"}],"choice":"Business Expenses"}],{"action":"jump","label":"innkeeper_chat"}],"innkeeper_deductions":[{"caption":"Accountant","text":"So, about deductions..."},{"caption":"Accountant","text":"So I guess you'll qualify for all the standard deductions..."},{"caption":"Accountant","text":"Your self, your husband...and your little Ike and Nancy, can't forget the deductions for dependents."},{"caption":"Barkeep","text":"NO. Ike is DEAD!"},{"caption":"Accountant","text":"Oh, oh my goodness, I'm so sorry..."},{"caption":"Accountant","text":"I had no idea..."},{"caption":"Barkeep","text":"-DEAD TO ME THAT IS!"},{"caption":"Accountant","text":"..."},{"caption":"Barkeep","text":"He's old enough to be helping out at the in, but it's all like 'No, that's not for me, old man!' Says he wants to go be an adventurer instead."},{"caption":"Barkeep","text":"Told him no son of mine was going to abandon the family business! Especially not to be some stinky adventurer out rolling in bogs and stepping in dragon poo!"},{"caption":"Barkeep","text":"Told him if he really wanted to make it on his own he could start paying his own way!"},{"caption":"Accountant","text":"Uhh...is this relevant to your taxes sir?"},{"caption":"Barkeep","text":"Well, excuse me if I take a moment to vent my frustrations."},{"caption":"Barkeep","text":"You know, if you wanted to earn your tip you ought to be willing to lend a listening ear every once and a while."},{"caption":"Barkeep","text":"Take it from me, ain't no body know how to make a tip better than a barkeep!"},{"caption":"Accountant","text":"Sir, I don't accept tips."},{"caption":"Barkeep","text":"FINE, I 'll get to the point. He pays rent now, so he ain't really a dependent anymore."},{"caption":"Accountant","text":"Okay, so just you and your husband and little Nancy then."},{"caption":"Barkeep","text":"Oh, actually Nancy passed, bless her soul. Went foraging for some mushrooms for dinner and accidentally handled a poisoned toad stool."},{"caption":"Accountant","text":"Oookay, I'll update my notes accordingly..."},{"action":"return"}]}
